import re
phones = {
    'BE':r'^(0*32)\d{8,11}',
    'US':r'^(\+?0*1)?[2-9]\d{2}[2-9](?!11)\d{6}',
    'FR':r'^(0*33)\d{8,11}',
    'ES':r'^(0*34)\d{8,11}',
    'CH':r'^(0*41)\d{8,11}',
    'MY':r'^(0*60)\d{8,11}',
    'AU':r'^(0*61)\d{8,11}',
    'PH':r'^(0*63)\d{8,11}',
    'JP':r'^(0*81)\d{8,11}',
    'IN':r'^(0*91)\d{8,11}',
    'BN':r'^(0*673)\d{8,11}',
    'HK':r'^(0*852)\d{8,11}',
    'MO':r'^(0*853)\d{8,11}',
    'NP':r'^(0*977)\d{8,11}',
    'NL':r'^(0*31)\d{8,11}',
    'HU':r'^(0*36)\d{8,11}',
    'GB':r'^(0*44)\d{8,11}',
    'DK':r'^(0*45)\d{8,11}',
    'PL':r'^(0*48)\d{8,11}',
    'CU':r'^(0*53)\d{8,11}',
    'SG':r'^(0*65)\d{8,11}',
    'KR':r'^(0*82)\d{8,11}',
    'TR':r'^(0*90)\d{8,11}',
    'KH':r'^(0*855)\d{8,11}',
    'TW':r'^(0*886)\d{8,11}',
    'BS':r'^(0*1242)\d{8,11}',
    }

nation = {
    'BE':'比利时',
    'US':'美国',
    'FR':'法国',
    'ES':'西班牙',
    'CH':'瑞士',
    'MY':'马来西亚',
    'AU':'澳大利亚',
    'PH':'菲律宾',
    'JP':'日本',
    'IN':'印度',
    'BN':'文莱',
    'HK':'香港',
    'MO':'澳门',
    'NP':'尼泊尔',
    'NL':'荷兰',
    'HU':'匈牙利',
    'GB':'英国',
    'DK':'丹麦',
    'PL':'波兰',
    'CU':'古巴',
    'SG':'新加坡',
    'KR':'韩国',
    'TR':'土耳其',
    'KH':'柬埔寨',
    'TW':'台湾省',
    'BS':'巴哈马',
    }

def verify_gwhm(phone):
    res = ''
    for id, reg in phones.items():
        mt = re.match(reg, phone)
        if mt is not None:
            print(id)
            res = nation[id]
            break
    return res

print(verify_gwhm('0012332222222'))
print(re.match('^(\+?0*1)?[2-9]\d{2}[2-9](?!11)\d{6}','0012332222222'))